app/Http/Controllers/ThreadController.php

    public function index(ThreadFilters $filters)
    {
        $threads = Thread::with('channel')->latest()->filter($filters)->get();
---
select * from `channels` where `channels`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)