app/Providers/AppServiceProvider.php

select * from `channels`
---
    public function boot()
    {
        View::composer('*',function($view){
            $channels = \Cache::rememberForever('channels',function (){
                return Channel::all();
            });